<?php

/**
 * Description from
 * https://ru.wikipedia.org/wiki/SMART
 */

return [
    'specific_hint' => 'Объясняется, что именно необходимо достигнуть. Например, «увеличить чистую прибыль собственного предприятия».',

    'measurable_hint' => 'Объясняется, в чем будет измеряться результат. Если показатель количественный, то необходимо выявить единицы измерения, если качественный, то необходимо выявить эталон отношения. Например, «увеличить прибыль собственного предприятия на 25 %, относительно чистой прибыли текущего года».',

    'achievable_hint' => 'Объясняется, за счёт чего планируется достигнуть цели. И возможно ли её достигнуть вообще? Например, «увеличить прибыль собственного предприятия на 25 %, относительно чистой прибыли текущего года, за счет снижения себестоимости продукции, автоматизации ресурсоемких операций и сокращения штата занятых на исполнении автоматизируемых операций сотрудников на 80 % от текущего количества». А вот совершить кругосветный круиз на резиновой уточке вряд ли удастся.',

    'relevant_hint' => 'Определение истинности цели. Действительно ли выполнение данной задачи позволит достичь желаемой цели? Необходимо удостовериться, что выполнение данной задачи действительно необходимо. Например, если брать «сокращение штата занятых на исполнении автоматизируемых операций сотрудников на 80 %» в качестве отдельной подзадачи, которая также ставится по SMART, то сотрудников можно не увольнять, а перевести на иные должности, на которых эти сотрудники смогут принести компании доход, а не просто экономию. Если брать страховую компанию, то вместо увольнения, сотрудникам можно предложить продолжить работу в качестве агента, либо не расходовать средства на автоматизацию, а просто увеличить норму выработки.',

    'time_bound_hint' => 'Определение временного триггера/промежутка по наступлению/окончанию которого должна быть достигнута цель (выполнена задача). Например, «К окончанию второго квартала следующего года увеличить прибыль собственного предприятия на 25 %, относительно чистой прибыли текущего года, за счет снижения себестоимости продукции, автоматизации ресурсоемких операций и сокращения штата занятых на исполнении автоматизируемых операций сотрудников на 80 % от текущего количества».',
];